Дошкольное_учреждение83/src/Catalogs/удуСчетаУчреждения/удуСчетаУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуСчетаУчреждения</name>
  <comment>Счета учреждения (расчетные, лицевые)</comment>
  <owners>Catalog.удуУчреждения</owners>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.удуВидыСчетовУчреждений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганаФК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОрганаФК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.удуБанки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанкКазначейства</name>
    <type>
      <types>CatalogRef.удуБанки</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуВидыСчетовУчреждений/удуВидыСчетовУчреждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыСчетовУчреждений</name>
  <enumValues>
    <name>Лицевой</name>
  </enumValues>
  <enumValues>
    <name>Расчетный</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуСчетаУчреждения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ИзменитьЗначенияРеквизитовОтВидаСчета()
	Если Объект.ВидСчета = Перечисления.удуВидыСчетовУчреждений.Лицевой Тогда
		Объект.Банк = Справочники.удуБанки.ПустаяСсылка();
		Если Не ЗначениеЗаполнено(Объект.НомерОрганаФК) Тогда
			Объект.НомерОрганаФК = Объект.Владелец.НомерОрганаФК;
		КонецЕсли;		
		Если Не ЗначениеЗаполнено(Объект.НаименованиеОрганаФК) Тогда
			Объект.НаименованиеОрганаФК = Объект.Владелец.НаименованиеОрганаФК;
		КонецЕсли;
	Иначе
		Объект.БанкКазначейства = Справочники.удуБанки.ПустаяСсылка();
		Объект.НомерОрганаФК = "";
		Объект.НаименованиеОрганаФК = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидСчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПодчиненныеЭлементы.ГруппаБанк.Видимость = Булево(Строка(Объект.ВидСчета) = "Расчетный");
	ПодчиненныеЭлементы.ГруппаКазначейство.Видимость = Булево(Строка(Объект.ВидСчета) = "Лицевой");
	
	ИзменитьЗначенияРеквизитовОтВидаСчета();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.ВидСчета) Тогда
		ПодчиненныеЭлементы.ГруппаБанк.Видимость = Булево(Строка(Объект.ВидСчета) = "Расчетный");
		ПодчиненныеЭлементы.ГруппаКазначейство.Видимость = Булево(Строка(Объект.ВидСчета) = "Лицевой");		
	Иначе
		ПодчиненныеЭлементы.ГруппаБанк.Видимость = Ложь;
		ПодчиненныеЭлементы.ГруппаКазначейство.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидСчета) Тогда
		Объект.ВидСчета = Перечисления.удуВидыСчетовУчреждений.Лицевой;
	КонецЕсли;
	
	Если Объект.ВидСчета = Перечисления.удуВидыСчетовУчреждений.Лицевой Тогда
		Если Не ЗначениеЗаполнено(Объект.НомерОрганаФК) Тогда
			Объект.НомерОрганаФК = Объект.Владелец.НомерОрганаФК;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Объект.НаименованиеОрганаФК) Тогда
			Объект.НаименованиеОрганаФК = Объект.Владелец.НаименованиеОрганаФК;
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры
